package com.cgg.administrator.myshow.utils;

import java.util.List;

/**
 * Created by Administrator on 2016/12/20.
 */

public class JokeTextBack{
    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":1055,"ret_code":0,"contentlist":[{"id":"5858e5136e36392559afb608","title":"我举着戒指：你愿意嫁","text":"我举着戒指：你愿意嫁给我吗？\r\n她：哦天哪，我愿意。\r\n她戴上了戒指，智力+2，随后改变了主意～","type":1,"ct":"2016-12-20 16:00:19.252"},{"id":"5858de4b6e36392559afa678","text":"大海里的两头鲨鱼在聊天，一头鲨鱼说：\u201c等会儿有人潜水的话，咱们别咬他了。\u201d另一头鲨鱼问：\u201c那我们该怎么做呢？\u201d\u201c我们直接把他头上戴着的那个玩意儿抢过来就行了，这样，咱们就可以戴着它上岸玩了。\u201d","title":"笑死人的动物冷幽默","type":1,"ct":"2016-12-20 15:31:23.431"},{"id":"5858d6f36e36392559af802f","text":"<p>\r\n\t\t1、有话好好说，TM别掀我被窝！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、早上，路上有一个小孩愤愤的骂道：玛蛋，这么冷的天全家都在睡觉。就老子一个上学！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、天很冷，你记得多穿一件外套，我说冷的时候好脱下来给我。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、天真的很冷了，晚上睡觉放个屁都不舍得掀开被窝，你说这屁要是不臭，那放屁该是件多美好的事儿埃\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、\u201c别怕！ \u201d \u201c勇敢一点！ \u201d \u201c稍微忍耐一下！ \u201d \u201c你可以的！ \u201d \u201c不过是短暂的分别！ \u201d \u201c很快就好了！ \u201d \u201c加油！ \u201d \u2026\u2026 在温暖的被窝里，我蜷曲着身子，握紧拳头，大声地给自己鼓劲，为起夜上厕所攒足了勇气。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c好累哦\u201d <p><\/p>......","title":"冬天真TM冷,不信你瞅","type":1,"ct":"2016-12-20 15:00:03.458"},{"id":"5858d6f36e36392559af802d","text":"<p>\r\n\t\t1、我：\u201c大师，我怎么样才能把烟戒了？\u201d<p><\/p>\r\n大师：\u201c年轻人，找个女朋友吧～\u201d<p><\/p>\r\n我：\u201c啊！我明白了，大师，你的意思是她会帮助我！？\u201d<p><\/p>\r\n大师摇了摇头：\u201c到了那个时候你就没钱买烟了，就是有了烟，怕你也不敢抽啊！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一日看见大师，便请求算一卦：\u201c我这有钱有车，咋感觉那么空虚呢？\u201d<p><\/p>\r\n大师拿起打火机把我衣服点着了，我赶紧吹灭了：\u201c大师，你是说钱财是身外之物？\u201d<p><\/p>\r\n\u201c我说你不吹会死。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、青年相亲数次无果，遂求助大师：\u201c大师，为什么我每次话还没说两句，女生转头就走呢？\u201d<p><\/p>......","title":"为你指点人生迷津的搞笑大师","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af802c","text":"<p>\r\n\t\t1、\u201c心太软的人，肩膀一般都比较硬。\u201d<p><\/p>\r\n\u201c为什么？\u201d<p><\/p>\r\n\u201c因为他要把所有问题都自己扛！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、死刑囚犯临刑之前狠狠一脚踩死了一只蚂蚁，声称临死也要找个垫背的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一只看家狗为了看看外面的世界挣脱了狗链，回来后发现主人找来了另一只狗代替，狗很失落，猫见了问其故，狗伤心的说：\u201c我失链了。。。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、穆桂英看前线告急，心里很着急，就去将军营帐里面，看着将军走来走去，不好开口，将军问：\u201c你有何事？\u201d<p><\/p>\r\n穆桂英：\u201c在下穆氏\u2026\u2026\u201d<p><\/p>......","title":"高冷的段子,热烈的笑声","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af802b","text":"<p>\r\n\t\t1、南极这片大陆，也叫做QQ空间！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c我再也无法忍受你们这群只懂得看脸的人！ \u201d说罢，我头也不回地离开了五官科。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、怎么我看益达广告，就像小偷在分赃呢：这是你的一沓，这是你的一沓。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、最近很开心，老婆换果6了！丈母娘笑呵呵得接过她退下来的果5，我赶紧把诺基亚扔了，双手接过丈母娘的果4！我也是用苹果的人了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、我愿用我半壁江山，换我倾世容颜！这是一代女皇武则天临终时说的苍凉呓语。<p><\/p>\r\n可是，到了行将就木的时候，有再多的财富再多的江山，也依旧换不回倾世容颜，保养才是女人一辈子的事业，用了我家的面膜不仅可以让你完全素颜，还能让你皮肤白嫩，另招代理。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c废气先通过压缩冲程，再通过排气冲程。最后清脆的一声排入空气中，和空气融合。由于分子不停的运动被他人吸收。。。\u201d<p><\/p>......","title":"神经的逗B,搞笑也任性","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af802a","text":"<p>\r\n\t\t1、\u201c五行缺水火，纹身纹什么好？\u201d<p><\/p>\r\n\u201c纹个火龙果，水果带水，火龙带火。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、包子最怕什么？<p><\/p>\r\n最怕豆，因为豆杀包。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一个核桃坐在家门口不语。<p><\/p>\r\n邻居看到后，问道：\u201c怎么了？\u201d<p><\/p>\r\n核桃叹了口气说：\u201c老婆说我的脸皮好厚啊！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、噗通～ 肉丸子一溜掉进火锅里，溅起水花。<p><\/p>\r\n羊肉白了脸说：\u201c溅人！ \u201d<p><\/p>\r\n肉丸子浮浮沉沉对羊肉说：\u201c你个骚货！ \u201d<p><\/p>\r\n火锅气得咕噜冒泡吼道：\u201c都给我滚！ \u201d<p><\/p>\r\n于是汤汁翻涌，顿时间香飘四溢，白烟悄悄的迷蒙了眼镜片 。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、丐帮一向秉持正义，每个月都会和少林、武当等名门正派共商要事，但说实话，<p><\/p>......","title":"冷的舒服,笑的也畅亮","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af8028","text":"<p>\r\n\t\t1、小猫和小狗看着冻得瑟瑟发抖的主人，心里嘀咕着：人类真傻B，闲着没事的时候为什么不长点毛呢？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一条蜈蚣正在房间里看成人漫画书，蜈蚣妈妈突然闯了进来，蜈蚣吓得把手背在身后，蜈蚣妈妈说：蚯蚓，你见到我儿子了吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有一天，一只狼闯入羊群，羊对狼说：\u201c你要吃我们也可以，但是首先你要数清楚我们有多少只，你数对了，我们乖乖让你吃。\u201d<p><\/p>\r\n狼想还有这种好事，就答应了。然后羊排好队，狼就开始数，一只羊两只羊三只羊。。。不一会儿，狼睡着了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、小鸡从小家里穷，买不起肉，于是养了条蚯蚓，每天切一点做饭，反正过几天还能长出来，后来为了荤素搭配，它又种了点韭菜。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、出门前，章鱼妈妈反复叮嘱儿子：天气凉了，可千万别感冒啊！切记！小章鱼好奇地问：为什么说得这么严重？<p><\/p>......","title":"再冷冷不过动物,瑟瑟发抖的感脚","type":1,"ct":"2016-12-20 15:00:03.260"},{"id":"5858d6f36e36392559af8027","text":"<p>\r\n\t\t1、两老汉聊天，一老汉说：\u201c我儿子出息了，在城里大公司当经理，年薪20万，你儿子呢？\u201d<p><\/p>\r\n另一个说：\u201c不知道，听说谁找到他会奖励100万。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、邻居家大姨的儿子29了，和他女朋友谈了一两年还没结婚。 <p><\/p>\r\n一次闲谈我问大姨：\u201c你儿子都29了，啥时候结婚，俺还等着吃喜糖呢。\u201d<p><\/p>\r\n大姨回答：\u201c我也着急呀，就等她女朋友离婚啦！ \u201d<p><\/p>\r\n当时我就凌乱了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一天小明过马路，看到一个老奶奶摔倒了，小明本着做好事的精神，过去扶起了老奶奶，\u201c老奶奶，摔痛了吗？\u201d老奶奶紧紧握着小明的手０终于遇到好人了，你叫什么名字！ \u201d<p><\/p>......","title":"零下冷幽默,笑僵你的脸","type":1,"ct":"2016-12-20 15:00:03.260"},{"id":"5858d6f36e36392559af8026","text":"<p>\r\n\t\t1、现在的女孩子医学知识懂的是越来越多了啊！昨天我在街上和一个女孩子搭讪，没聊几句话呢，她就下结论，说：\u201c你有脖。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、常年肾虚的老赵为了能在老婆面前抬起头来，毅然决然的来到医院，治疗颈椎玻\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有没有懂跑车的朋友，求推荐一款400万到800万的跑车，要求性能好，起步快，马力大，舒适性高的，外观时尚又好看的，我拿来当手机纸壁。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、吃冰淇淋不会胖，因为是凉的，没有热量。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、小明生来就是哑巴，四处求医问药，终于在18岁那年治好了，他实在......","title":"巨冷的逗B,笑友的最爱","type":1,"ct":"2016-12-20 15:00:03.260"},{"id":"5858d6f36e36392559af8025","text":"<p>\r\n\t\t1、心理医生说我得了人格分裂，我连忙问道：\u201c那我呢？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、人类学家研究发现，如果你踩一个人类的脚，他就会有极大可能张开嘴，而嘴长多大取决于你踩的力度。科学家们进一步推断出：人类可能是垃圾桶进化而来的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、那些不愉快的经历，会随着时间慢慢消失，刻意把它隐瞒反而更明显更狼狈。踩到屎了，就若无其事继续走，走不了多久鞋底自然就干净了。而如果你在地上使劲蹭，谁都能猜到你在干什么。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、万万没想到请问千千想到了吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、甘蔗那玩意太好吃......","title":"逗B说话,深刻有哲理啊","type":1,"ct":"2016-12-20 15:00:03.259"},{"id":"5858d6f36e36392559af8024","text":"<p>\r\n\t\t1、昨个夜里在宾馆，一下子来了两个空姐！一会儿亲这里，一会儿亲哪里，还唱着小曲！为了征服他们，从十一点奋战到了凌晨一点！终于给他们拍死了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、老王和他的老婆都是单眼皮，但老王希望自己的孩子能是双眼皮，<p><\/p>\r\n于是在老婆怀孕的期间天天吃斋念佛，终于感动了上苍，他老婆给他生了个双眼皮的孩子。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、给老婆讲各种吉尼斯世界纪录，老婆不为所动！讲到世界上最长的黄瓜104厘米时，老婆终于\u201c哇\u201d了一声！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、\u201c我兄弟见到美女就想吐！ \u201d<p><\/p>\r\n\u201c你兄弟谁氨<p><\/p>......","title":"高冷有内涵,秒懂者没节操","type":1,"ct":"2016-12-20 15:00:03.259"},{"id":"5858d6f36e36392559af8023","text":"<p>\r\n\t\t1、你们说现在物价涨的多厉害，10年前，拿上10块钱，到小卖部，面包、汽水、火腿肠能买好些，现在就不行了，现在都装监控了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、早上排队买早餐，有个粗大的汉子插队到我前面，我生气的说：\u201c怎么插队呢？\u201d<p><\/p>\r\n他回头看了看我，咧嘴一笑说：\u201c很简单啦，首先在前面找个位置，然后挤进去就行了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、同事问：小沈阳和李玉刚都是靠男扮女装出名的，你们觉得谁更像女人？<p><\/p>\r\n其一幽默同聊说：我觉得李宇春更像女人！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、我问室友，用八个字形容幸福怎么说？<p><\/p>......","title":"逗B看世界,大大的不同","type":1,"ct":"2016-12-20 15:00:03.258"},{"id":"5858d0426e36392559af6ea7","text":"<p>\r\n\t\t1、\u201c老板你过来看下。\u201d<p><\/p>\r\n\u201c怎么？\u201d<p><\/p>\r\n\u201c瞅你这什么烂玩意儿，没籽还卖那么贵！！ \u201d<p><\/p>\r\n\u201c这样才符合现在的流行趋势啊，看现在的木瓜西瓜都是没有籽的。\u201d<p><\/p>\r\n\u201c那你卖给我的瓜子没有籽是几个意思！！！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c哥们，听说你在殡仪馆工作，工资怎么样啊？\u201d<p><\/p>\r\n\u201c挺好的，一个月一万多。\u201d<p><\/p>\r\n\u201c那你们那还要人么？\u201d<p><\/p>\r\n\u201c当然要，我们这24小时都要人。 \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天到银行ATM排队查帐，轮到我，查到余额为0，十分失望，马上退卡准备走人。。。<p><\/p>......","title":"囧事几小段,惊呆小伙伴","type":1,"ct":"2016-12-20 14:31:30.577"},{"id":"5858d0426e36392559af6ea6","text":"<p>\r\n\t\t1、餐厅里，一位单身汉对我说：\u201c好羡慕，我什么时候也能有机会吃情侣套餐呢？\u201d<p><\/p>\r\n我安慰他说：\u201c别灰心，只要有钱，像我这样，一个人也能买情侣套餐。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c来人\u201d<p><\/p>\r\n\u201c在，娘娘有什么吩咐？\u201d<p><\/p>\r\n\u201c我怀疑宮中有人对我用巫蛊之术！ \u201d<p><\/p>\r\n\u201c这。。。怎么说？\u201d<p><\/p>\r\n\u201c最近手总是点付款，根本停不下来，所以我怀疑有人加害本宫。\u201d <p><\/p>\r\n\u201c。。。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、中午回家和一辆别克刮上了，把他蹭掉漆了，别克车主下来看看车，又看看我，说：人没伤着就行，你走吧。。。<p><\/p>......","title":"巨冷逗B,搞笑不能没有你","type":1,"ct":"2016-12-20 14:31:30.577"},{"id":"5858d0426e36392559af6ea2","text":"<p>\r\n\t\t1、\u201c别说眼前一亮，亮瞎都没问题。\u201d--电焊自豪的说道。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、最装B的莫过于西游记里的那些神仙了，个个都会腾云驾雾了却还要坐骑。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、西游记总体来说是个送餐和洗桑拿的故事。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、如果向神求助，说明相信神的能力；如果神没有帮助你，说明神相信你的能力。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、井水不犯河水，河水污染井水。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、今年出生的孩子不容易失眠，因为他们会属羊。\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、猜谜语：李代沫，黄海波，宁财神，张耀扬，郭美美，张默，高虎，柯震东，房祖名。\u2014\u2014 猜一个世界著名大城市？<p><\/p>......","title":"蛇精病思维,亮瞎没问题","type":1,"ct":"2016-12-20 14:31:30.397"},{"id":"5858d0426e36392559af6ea1","text":"近日，有动物居然到森林游行，原来，是猢狲们集体抗议树木成长过程中拔苗助长，致使根部不稳固，容易倒，影响猢狲的名誉。","title":"临近3.15,动物们最近频频举报","type":1,"ct":"2016-12-20 14:31:30.398"},{"id":"5858d0426e36392559af6e9f","text":"<p>\r\n\t\t1、戒烟最难的并不是自己的烟瘾依赖，而是兄弟们软磨硬泡的让你吸，其实兄弟们的想法也很单纯：TM我不戒，你也休想戒！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天在公交车上捡了四万，本抱着良心在公交车上等失主，没想到一等就是一天都没等到，我说你们麻将少了个四万还怎么打。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有一次，有一个朋友收到一条短信。气死他了。短信是：嘟的一声来信息，傻B赶紧看手机，打开手机看信息，越看越像大傻B，傻B傻B气死你，你也不敢摔手机。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、现在的司机，怎么那么爱在会车的打远光灯开车，做一个文明的司机有......","title":"逗B驾到,谁见谁笑","type":1,"ct":"2016-12-20 14:31:30.397"},{"id":"5858d0426e36392559af6e9e","text":"萤火虫：没有危险意识，缺乏消防观念，涉嫌故意纵火罪。","title":"3.15,动物界也开始打假","type":1,"ct":"2016-12-20 14:31:30.396"},{"id":"5858d0426e36392559af6e9d","text":"<p>\r\n\t\t1、天冷，哥们买了个口罩，但抽烟又不方便，于是。。他花了五块钱儿，到做衣服的阿姨那缝了一个小拉链，抽烟就拉开，那回头率。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、刚提着滚烫的开水，发现腿上一只该死的苍蝇在我的腿上，我顿时就有个个不错的想法：烫死它。。。你没猜错，一阵杀猪般的惨叫声！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、看见一个骑70摩托车的小伙被Pol.ice拦住了，小伙直接下车，把钥匙弄断，轮胎放气，往马路上一推撒腿就跑。。。<p><\/p>\r\n只听Pol.ice在后面喊，回来把你车推走，我不查车，问你借个火！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、媳妇自告奋勇周末带老妈去公园溜溜，结果把老人家扔在公园长椅上，自个儿玩过山车，大摆锤，玩开心独自回家来了，进门一拍脑袋，哎呀，把老妈扔在公园了，唉。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、小时侯，看了《西游记》中太上老君在炉子里烧悟空烧成火眼金睛之后，我就整天知道如何像他一样也能让自己变成火眼金睛。<p><\/p>......","title":"爆糗事迹,二货和脑残族的杰作","type":1,"ct":"2016-12-20 14:31:30.393"}],"currentPage":1,"allNum":21081,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 1055
         * ret_code : 0
         * contentlist : [{"id":"5858e5136e36392559afb608","title":"我举着戒指：你愿意嫁","text":"我举着戒指：你愿意嫁给我吗？\r\n她：哦天哪，我愿意。\r\n她戴上了戒指，智力+2，随后改变了主意～","type":1,"ct":"2016-12-20 16:00:19.252"},{"id":"5858de4b6e36392559afa678","text":"大海里的两头鲨鱼在聊天，一头鲨鱼说：\u201c等会儿有人潜水的话，咱们别咬他了。\u201d另一头鲨鱼问：\u201c那我们该怎么做呢？\u201d\u201c我们直接把他头上戴着的那个玩意儿抢过来就行了，这样，咱们就可以戴着它上岸玩了。\u201d","title":"笑死人的动物冷幽默","type":1,"ct":"2016-12-20 15:31:23.431"},{"id":"5858d6f36e36392559af802f","text":"<p>\r\n\t\t1、有话好好说，TM别掀我被窝！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、早上，路上有一个小孩愤愤的骂道：玛蛋，这么冷的天全家都在睡觉。就老子一个上学！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、天很冷，你记得多穿一件外套，我说冷的时候好脱下来给我。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、天真的很冷了，晚上睡觉放个屁都不舍得掀开被窝，你说这屁要是不臭，那放屁该是件多美好的事儿埃\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、\u201c别怕！ \u201d \u201c勇敢一点！ \u201d \u201c稍微忍耐一下！ \u201d \u201c你可以的！ \u201d \u201c不过是短暂的分别！ \u201d \u201c很快就好了！ \u201d \u201c加油！ \u201d \u2026\u2026 在温暖的被窝里，我蜷曲着身子，握紧拳头，大声地给自己鼓劲，为起夜上厕所攒足了勇气。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c好累哦\u201d <p><\/p>......","title":"冬天真TM冷,不信你瞅","type":1,"ct":"2016-12-20 15:00:03.458"},{"id":"5858d6f36e36392559af802d","text":"<p>\r\n\t\t1、我：\u201c大师，我怎么样才能把烟戒了？\u201d<p><\/p>\r\n大师：\u201c年轻人，找个女朋友吧～\u201d<p><\/p>\r\n我：\u201c啊！我明白了，大师，你的意思是她会帮助我！？\u201d<p><\/p>\r\n大师摇了摇头：\u201c到了那个时候你就没钱买烟了，就是有了烟，怕你也不敢抽啊！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一日看见大师，便请求算一卦：\u201c我这有钱有车，咋感觉那么空虚呢？\u201d<p><\/p>\r\n大师拿起打火机把我衣服点着了，我赶紧吹灭了：\u201c大师，你是说钱财是身外之物？\u201d<p><\/p>\r\n\u201c我说你不吹会死。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、青年相亲数次无果，遂求助大师：\u201c大师，为什么我每次话还没说两句，女生转头就走呢？\u201d<p><\/p>......","title":"为你指点人生迷津的搞笑大师","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af802c","text":"<p>\r\n\t\t1、\u201c心太软的人，肩膀一般都比较硬。\u201d<p><\/p>\r\n\u201c为什么？\u201d<p><\/p>\r\n\u201c因为他要把所有问题都自己扛！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、死刑囚犯临刑之前狠狠一脚踩死了一只蚂蚁，声称临死也要找个垫背的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一只看家狗为了看看外面的世界挣脱了狗链，回来后发现主人找来了另一只狗代替，狗很失落，猫见了问其故，狗伤心的说：\u201c我失链了。。。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、穆桂英看前线告急，心里很着急，就去将军营帐里面，看着将军走来走去，不好开口，将军问：\u201c你有何事？\u201d<p><\/p>\r\n穆桂英：\u201c在下穆氏\u2026\u2026\u201d<p><\/p>......","title":"高冷的段子,热烈的笑声","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af802b","text":"<p>\r\n\t\t1、南极这片大陆，也叫做QQ空间！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c我再也无法忍受你们这群只懂得看脸的人！ \u201d说罢，我头也不回地离开了五官科。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、怎么我看益达广告，就像小偷在分赃呢：这是你的一沓，这是你的一沓。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、最近很开心，老婆换果6了！丈母娘笑呵呵得接过她退下来的果5，我赶紧把诺基亚扔了，双手接过丈母娘的果4！我也是用苹果的人了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、我愿用我半壁江山，换我倾世容颜！这是一代女皇武则天临终时说的苍凉呓语。<p><\/p>\r\n可是，到了行将就木的时候，有再多的财富再多的江山，也依旧换不回倾世容颜，保养才是女人一辈子的事业，用了我家的面膜不仅可以让你完全素颜，还能让你皮肤白嫩，另招代理。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c废气先通过压缩冲程，再通过排气冲程。最后清脆的一声排入空气中，和空气融合。由于分子不停的运动被他人吸收。。。\u201d<p><\/p>......","title":"神经的逗B,搞笑也任性","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af802a","text":"<p>\r\n\t\t1、\u201c五行缺水火，纹身纹什么好？\u201d<p><\/p>\r\n\u201c纹个火龙果，水果带水，火龙带火。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、包子最怕什么？<p><\/p>\r\n最怕豆，因为豆杀包。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一个核桃坐在家门口不语。<p><\/p>\r\n邻居看到后，问道：\u201c怎么了？\u201d<p><\/p>\r\n核桃叹了口气说：\u201c老婆说我的脸皮好厚啊！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、噗通～ 肉丸子一溜掉进火锅里，溅起水花。<p><\/p>\r\n羊肉白了脸说：\u201c溅人！ \u201d<p><\/p>\r\n肉丸子浮浮沉沉对羊肉说：\u201c你个骚货！ \u201d<p><\/p>\r\n火锅气得咕噜冒泡吼道：\u201c都给我滚！ \u201d<p><\/p>\r\n于是汤汁翻涌，顿时间香飘四溢，白烟悄悄的迷蒙了眼镜片 。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、丐帮一向秉持正义，每个月都会和少林、武当等名门正派共商要事，但说实话，<p><\/p>......","title":"冷的舒服,笑的也畅亮","type":1,"ct":"2016-12-20 15:00:03.262"},{"id":"5858d6f36e36392559af8028","text":"<p>\r\n\t\t1、小猫和小狗看着冻得瑟瑟发抖的主人，心里嘀咕着：人类真傻B，闲着没事的时候为什么不长点毛呢？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一条蜈蚣正在房间里看成人漫画书，蜈蚣妈妈突然闯了进来，蜈蚣吓得把手背在身后，蜈蚣妈妈说：蚯蚓，你见到我儿子了吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有一天，一只狼闯入羊群，羊对狼说：\u201c你要吃我们也可以，但是首先你要数清楚我们有多少只，你数对了，我们乖乖让你吃。\u201d<p><\/p>\r\n狼想还有这种好事，就答应了。然后羊排好队，狼就开始数，一只羊两只羊三只羊。。。不一会儿，狼睡着了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、小鸡从小家里穷，买不起肉，于是养了条蚯蚓，每天切一点做饭，反正过几天还能长出来，后来为了荤素搭配，它又种了点韭菜。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、出门前，章鱼妈妈反复叮嘱儿子：天气凉了，可千万别感冒啊！切记！小章鱼好奇地问：为什么说得这么严重？<p><\/p>......","title":"再冷冷不过动物,瑟瑟发抖的感脚","type":1,"ct":"2016-12-20 15:00:03.260"},{"id":"5858d6f36e36392559af8027","text":"<p>\r\n\t\t1、两老汉聊天，一老汉说：\u201c我儿子出息了，在城里大公司当经理，年薪20万，你儿子呢？\u201d<p><\/p>\r\n另一个说：\u201c不知道，听说谁找到他会奖励100万。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、邻居家大姨的儿子29了，和他女朋友谈了一两年还没结婚。 <p><\/p>\r\n一次闲谈我问大姨：\u201c你儿子都29了，啥时候结婚，俺还等着吃喜糖呢。\u201d<p><\/p>\r\n大姨回答：\u201c我也着急呀，就等她女朋友离婚啦！ \u201d<p><\/p>\r\n当时我就凌乱了。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一天小明过马路，看到一个老奶奶摔倒了，小明本着做好事的精神，过去扶起了老奶奶，\u201c老奶奶，摔痛了吗？\u201d老奶奶紧紧握着小明的手０终于遇到好人了，你叫什么名字！ \u201d<p><\/p>......","title":"零下冷幽默,笑僵你的脸","type":1,"ct":"2016-12-20 15:00:03.260"},{"id":"5858d6f36e36392559af8026","text":"<p>\r\n\t\t1、现在的女孩子医学知识懂的是越来越多了啊！昨天我在街上和一个女孩子搭讪，没聊几句话呢，她就下结论，说：\u201c你有脖。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、常年肾虚的老赵为了能在老婆面前抬起头来，毅然决然的来到医院，治疗颈椎玻\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有没有懂跑车的朋友，求推荐一款400万到800万的跑车，要求性能好，起步快，马力大，舒适性高的，外观时尚又好看的，我拿来当手机纸壁。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、吃冰淇淋不会胖，因为是凉的，没有热量。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、小明生来就是哑巴，四处求医问药，终于在18岁那年治好了，他实在......","title":"巨冷的逗B,笑友的最爱","type":1,"ct":"2016-12-20 15:00:03.260"},{"id":"5858d6f36e36392559af8025","text":"<p>\r\n\t\t1、心理医生说我得了人格分裂，我连忙问道：\u201c那我呢？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、人类学家研究发现，如果你踩一个人类的脚，他就会有极大可能张开嘴，而嘴长多大取决于你踩的力度。科学家们进一步推断出：人类可能是垃圾桶进化而来的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、那些不愉快的经历，会随着时间慢慢消失，刻意把它隐瞒反而更明显更狼狈。踩到屎了，就若无其事继续走，走不了多久鞋底自然就干净了。而如果你在地上使劲蹭，谁都能猜到你在干什么。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、万万没想到请问千千想到了吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、甘蔗那玩意太好吃......","title":"逗B说话,深刻有哲理啊","type":1,"ct":"2016-12-20 15:00:03.259"},{"id":"5858d6f36e36392559af8024","text":"<p>\r\n\t\t1、昨个夜里在宾馆，一下子来了两个空姐！一会儿亲这里，一会儿亲哪里，还唱着小曲！为了征服他们，从十一点奋战到了凌晨一点！终于给他们拍死了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、老王和他的老婆都是单眼皮，但老王希望自己的孩子能是双眼皮，<p><\/p>\r\n于是在老婆怀孕的期间天天吃斋念佛，终于感动了上苍，他老婆给他生了个双眼皮的孩子。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、给老婆讲各种吉尼斯世界纪录，老婆不为所动！讲到世界上最长的黄瓜104厘米时，老婆终于\u201c哇\u201d了一声！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、\u201c我兄弟见到美女就想吐！ \u201d<p><\/p>\r\n\u201c你兄弟谁氨<p><\/p>......","title":"高冷有内涵,秒懂者没节操","type":1,"ct":"2016-12-20 15:00:03.259"},{"id":"5858d6f36e36392559af8023","text":"<p>\r\n\t\t1、你们说现在物价涨的多厉害，10年前，拿上10块钱，到小卖部，面包、汽水、火腿肠能买好些，现在就不行了，现在都装监控了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、早上排队买早餐，有个粗大的汉子插队到我前面，我生气的说：\u201c怎么插队呢？\u201d<p><\/p>\r\n他回头看了看我，咧嘴一笑说：\u201c很简单啦，首先在前面找个位置，然后挤进去就行了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、同事问：小沈阳和李玉刚都是靠男扮女装出名的，你们觉得谁更像女人？<p><\/p>\r\n其一幽默同聊说：我觉得李宇春更像女人！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、我问室友，用八个字形容幸福怎么说？<p><\/p>......","title":"逗B看世界,大大的不同","type":1,"ct":"2016-12-20 15:00:03.258"},{"id":"5858d0426e36392559af6ea7","text":"<p>\r\n\t\t1、\u201c老板你过来看下。\u201d<p><\/p>\r\n\u201c怎么？\u201d<p><\/p>\r\n\u201c瞅你这什么烂玩意儿，没籽还卖那么贵！！ \u201d<p><\/p>\r\n\u201c这样才符合现在的流行趋势啊，看现在的木瓜西瓜都是没有籽的。\u201d<p><\/p>\r\n\u201c那你卖给我的瓜子没有籽是几个意思！！！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c哥们，听说你在殡仪馆工作，工资怎么样啊？\u201d<p><\/p>\r\n\u201c挺好的，一个月一万多。\u201d<p><\/p>\r\n\u201c那你们那还要人么？\u201d<p><\/p>\r\n\u201c当然要，我们这24小时都要人。 \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、今天到银行ATM排队查帐，轮到我，查到余额为0，十分失望，马上退卡准备走人。。。<p><\/p>......","title":"囧事几小段,惊呆小伙伴","type":1,"ct":"2016-12-20 14:31:30.577"},{"id":"5858d0426e36392559af6ea6","text":"<p>\r\n\t\t1、餐厅里，一位单身汉对我说：\u201c好羡慕，我什么时候也能有机会吃情侣套餐呢？\u201d<p><\/p>\r\n我安慰他说：\u201c别灰心，只要有钱，像我这样，一个人也能买情侣套餐。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c来人\u201d<p><\/p>\r\n\u201c在，娘娘有什么吩咐？\u201d<p><\/p>\r\n\u201c我怀疑宮中有人对我用巫蛊之术！ \u201d<p><\/p>\r\n\u201c这。。。怎么说？\u201d<p><\/p>\r\n\u201c最近手总是点付款，根本停不下来，所以我怀疑有人加害本宫。\u201d <p><\/p>\r\n\u201c。。。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、中午回家和一辆别克刮上了，把他蹭掉漆了，别克车主下来看看车，又看看我，说：人没伤着就行，你走吧。。。<p><\/p>......","title":"巨冷逗B,搞笑不能没有你","type":1,"ct":"2016-12-20 14:31:30.577"},{"id":"5858d0426e36392559af6ea2","text":"<p>\r\n\t\t1、\u201c别说眼前一亮，亮瞎都没问题。\u201d--电焊自豪的说道。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、最装B的莫过于西游记里的那些神仙了，个个都会腾云驾雾了却还要坐骑。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、西游记总体来说是个送餐和洗桑拿的故事。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、如果向神求助，说明相信神的能力；如果神没有帮助你，说明神相信你的能力。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、井水不犯河水，河水污染井水。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、今年出生的孩子不容易失眠，因为他们会属羊。\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、猜谜语：李代沫，黄海波，宁财神，张耀扬，郭美美，张默，高虎，柯震东，房祖名。\u2014\u2014 猜一个世界著名大城市？<p><\/p>......","title":"蛇精病思维,亮瞎没问题","type":1,"ct":"2016-12-20 14:31:30.397"},{"id":"5858d0426e36392559af6ea1","text":"近日，有动物居然到森林游行，原来，是猢狲们集体抗议树木成长过程中拔苗助长，致使根部不稳固，容易倒，影响猢狲的名誉。","title":"临近3.15,动物们最近频频举报","type":1,"ct":"2016-12-20 14:31:30.398"},{"id":"5858d0426e36392559af6e9f","text":"<p>\r\n\t\t1、戒烟最难的并不是自己的烟瘾依赖，而是兄弟们软磨硬泡的让你吸，其实兄弟们的想法也很单纯：TM我不戒，你也休想戒！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、今天在公交车上捡了四万，本抱着良心在公交车上等失主，没想到一等就是一天都没等到，我说你们麻将少了个四万还怎么打。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有一次，有一个朋友收到一条短信。气死他了。短信是：嘟的一声来信息，傻B赶紧看手机，打开手机看信息，越看越像大傻B，傻B傻B气死你，你也不敢摔手机。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、现在的司机，怎么那么爱在会车的打远光灯开车，做一个文明的司机有......","title":"逗B驾到,谁见谁笑","type":1,"ct":"2016-12-20 14:31:30.397"},{"id":"5858d0426e36392559af6e9e","text":"萤火虫：没有危险意识，缺乏消防观念，涉嫌故意纵火罪。","title":"3.15,动物界也开始打假","type":1,"ct":"2016-12-20 14:31:30.396"},{"id":"5858d0426e36392559af6e9d","text":"<p>\r\n\t\t1、天冷，哥们买了个口罩，但抽烟又不方便，于是。。他花了五块钱儿，到做衣服的阿姨那缝了一个小拉链，抽烟就拉开，那回头率。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、刚提着滚烫的开水，发现腿上一只该死的苍蝇在我的腿上，我顿时就有个个不错的想法：烫死它。。。你没猜错，一阵杀猪般的惨叫声！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、看见一个骑70摩托车的小伙被Pol.ice拦住了，小伙直接下车，把钥匙弄断，轮胎放气，往马路上一推撒腿就跑。。。<p><\/p>\r\n只听Pol.ice在后面喊，回来把你车推走，我不查车，问你借个火！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、媳妇自告奋勇周末带老妈去公园溜溜，结果把老人家扔在公园长椅上，自个儿玩过山车，大摆锤，玩开心独自回家来了，进门一拍脑袋，哎呀，把老妈扔在公园了，唉。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、小时侯，看了《西游记》中太上老君在炉子里烧悟空烧成火眼金睛之后，我就整天知道如何像他一样也能让自己变成火眼金睛。<p><\/p>......","title":"爆糗事迹,二货和脑残族的杰作","type":1,"ct":"2016-12-20 14:31:30.393"}]
         * currentPage : 1
         * allNum : 21081
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * id : 5858e5136e36392559afb608
             * title : 我举着戒指：你愿意嫁
             * text : 我举着戒指：你愿意嫁给我吗？
             她：哦天哪，我愿意。
             她戴上了戒指，智力+2，随后改变了主意～
             * type : 1
             * ct : 2016-12-20 16:00:19.252
             */

            private String id;
            private String title;
            private String text;
            private int type;
            private String ct;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
